# 5. Data Check

In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='Application Number')
df

,Name,School,Height,English,Math,Biology,Finance,Coding
Application Number,,,,,,,,
#1,Ian,A1,178,90,100,88,95,Python
#2,Jason,A2,198,100,82,78,88,NaN
#3,Smith,A2,168,85,87,90,75,C++
#4,John,A1,188,70,65,95,92,Java
#5,Kara,A1,201,82,78,88,84,NaN
#6,Daisy,A1,172,91,80,76,80,NaN
#7,Jack,A2,174,77,50,85,100,R
#8,Poppy,A1,180,80,90,70,89,Python

## DataFrame check
Provide statistical info by column

In [2]:
df.describe()

           Height     English        Math    Biology     Finance
count    8.000000    8.000000    8.000000   8.000000    8.000000
mean   182.375000   84.375000   79.000000  83.750000   87.875000
std     12.141281    9.303417   15.464244   8.328094    8.096516
min    168.000000   70.000000   50.000000  70.000000   75.000000
25%    173.500000   79.250000   74.750000  77.500000   83.000000
50%    179.000000   83.500000   81.000000  86.500000   88.500000
75%    190.500000   90.250000   87.750000  88.500000   92.750000
max    201.000000  100.000000  100.000000  95.000000  100.000000

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, #1 to #8
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     8 non-null      object
 1   School   8 non-null      object
 2   Height   8 non-null      int64
 3   English  8 non-null      int64
 4   Math     8 non-null      int64
 5   Biology  8 non-null      int64
 6   Finance  8 non-null      int64
 7   Coding   5 non-null      object
dtypes: int64(5), object(3)
memory usage: 576.0+ bytes

In [4]:
df.head() # First 5 rows

,Name,School,Height,English,Math,Biology,Finance,Coding
Application Number,,,,,,,,
#1,Ian,A1,178,90,100,88,95,Python
#2,Jason,A2,198,100,82,78,88,NaN
#3,Smith,A2,168,85,87,90,75,C++
#4,John,A1,188,70,65,95,92,Java
#5,Kara,A1,201,82,78,88,84,NaN

In [5]:
df.head(7)

,Name,School,Height,English,Math,Biology,Finance,Coding
Application Number,,,,,,,,
#1,Ian,A1,178,90,100,88,95,Python
#2,Jason,A2,198,100,82,78,88,NaN
#3,Smith,A2,168,85,87,90,75,C++
#4,John,A1,188,70,65,95,92,Java
#5,Kara,A1,201,82,78,88,84,NaN
#6,Daisy,A1,172,91,80,76,80,NaN
#7,Jack,A2,174,77,50,85,100,R

In [6]:
df.tail() # Last 5 rows

,Name,School,Height,English,Math,Biology,Finance,Coding
Application Number,,,,,,,,
#4,John,A1,188,70,65,95,92,Java
#5,Kara,A1,201,82,78,88,84,NaN
#6,Daisy,A1,172,91,80,76,80,NaN
#7,Jack,A2,174,77,50,85,100,R
#8,Poppy,A1,180,80,90,70,89,Python

In [7]:
df.values

array([['Ian', 'A1', 178, 90, 100, 88, 95, 'Python'],
       ['Jason', 'A2', 198, 100, 82, 78, 88, nan],
       ['Smith', 'A2', 168, 85, 87, 90, 75, 'C++'],
       ['John', 'A1', 188, 70, 65, 95, 92, 'Java'],
       ['Kara', 'A1', 201, 82, 78, 88, 84, nan],
       ['Daisy', 'A1', 172, 91, 80, 76, 80, nan],
       ['Jack', 'A2', 174, 77, 50, 85, 100, 'R'],
       ['Poppy', 'A1', 180, 80, 90, 70, 89, 'Python']], dtype=object)

In [8]:
df.index

Index(['#1', '#2', '#3', '#4', '#5', '#6', '#7', '#8'], dtype='object', name='Application Number')

In [9]:
df.columns

Index(['Name', 'School', 'Height', 'English', 'Math', 'Biology', 'Finance',
       'Coding'],
      dtype='object')

In [10]:
df.shape # Size of row and column
df

,Name,School,Height,English,Math,Biology,Finance,Coding
Application Number,,,,,,,,
#1,Ian,A1,178,90,100,88,95,Python
#2,Jason,A2,198,100,82,78,88,NaN
#3,Smith,A2,168,85,87,90,75,C++
#4,John,A1,188,70,65,95,92,Java
#5,Kara,A1,201,82,78,88,84,NaN
#6,Daisy,A1,172,91,80,76,80,NaN
#7,Jack,A2,174,77,50,85,100,R
#8,Poppy,A1,180,80,90,70,89,Python

## Series check

In [11]:
df['Height'].describe()

count      8.000000
mean     182.375000
std       12.141281
min      168.000000
25%      173.500000
50%      179.000000
75%      190.500000
max      201.000000
Name: Height, dtype: float64

In [12]:
df['Height'].min()

168

In [13]:
df['Height'].max()

201

In [14]:
df['Height'].nlargest(3)

Application Number
#5    201
#2    198
#4    188
Name: Height, dtype: int64

In [15]:
df['Height'].mean()

182.375

In [16]:
df['Height'].sum()

1459

In [17]:
df['Coding'].count()

5

In [18]:
df['Coding'].unique()

array(['Python', nan, 'C++', 'Java', 'R'], dtype=object)

In [19]:
df['Coding'].nunique()

4